portal/app/Models/AdminModel.php

public function getAdminDetails($email)
{
    $builder = $this->db->table('admin');
    $builder->where('email', $email);

    $query = $builder->get();
---
SELECT *
FROM `admin`
WHERE `email` = 'admin@getfundedafrica.com'

public function getCreditRedeemSumByEmailPaid($Email)
{
    $builder = $this->db->table('Credit_Redeem');
    $builder->selectSum('Credit');
    $builder->where('Email', $Email);
    $builder->where('Credit >=', 45);
    $builder->where('Credit !=', 15);
    $builder->where('More_Info !=', '');
    $result = $builder->get()->getRow();
---
SELECT SUM(`Credit`) AS `Credit`
FROM `Credit_Redeem`
WHERE `Email` = 'smehelpdesk@wemabank.com'
AND `Credit` >= 45
AND `Credit` != 15
AND `More_Info` != ''

public function getCreditRedeemSumByEmail($Email)
{
    $builder = $this->db->table('Credit_Redeem');
    $builder->selectSum('Credit');
    $builder->where('Email', $Email);
    $result = $builder->get()->getRow();
---
SELECT SUM(`Credit`) AS `Credit`
FROM `Credit_Redeem`
WHERE `Email` = 'smehelpdesk@wemabank.com'

public function getAllWebinars()
{

    $query = $this->db->table('event_attend')
        ->groupBy('event, id') // Add 'id' to the GROUP BY clause
        ->orderBy('id', 'DESC')
        ->get();
---
SELECT *
FROM `event_attend`
GROUP BY `event`, `id`
ORDER BY `id` DESC